[M_Orchid_Grendel MissionDefinition]
MissionDescription="A fearsome creature is hiding out in [place]Hayter's Folly[-place]. Sir Hammerlock, a zoologist and master huntsman, has asked you to track down this creature and kill it."
TurnInDescription="You've killed the creature -- [place]Hayter's Folly[-place] is now safe! Apart from all the pirates. And the crystalisks. And the other creatures you didn't kill."
MissionSummary="Find and kill the creature."
